In [9]:
import pandas as pd

In [11]:
df = pd.read_excel('5.-Jumbled-up-Customers-Details.xlsx')
df

                                                Name  Address  Age  Gender
0  Name Hussein Hakeem Address Number 22 Fioye Cr...      NaN  NaN     NaN
1  Name Arojoye Samuel Address 11 Omolade Close O...      NaN  NaN     NaN
2  Name Alex Ezurum Address 1 Adamu Lane, Abuja A...      NaN  NaN     NaN
3  Name Susan Nwaimo Address Number 58 Yaba Stree...      NaN  NaN     NaN
4  Name Ajao Opeyemi Address No12 Olubunmi Street...      NaN  NaN     NaN
5  Name Banjoko Adebusola Address 34 Ngige Street...      NaN  NaN     NaN
6  Name Muhammed Olabisi Address 13, ICAN road, E...      NaN  NaN     NaN
7  Name Oluwagbemi Mojisola Address ACCA Lane, On...      NaN  NaN     NaN

In [12]:
df.columns

Index(['Name', 'Address', 'Age', 'Gender'], dtype='object')

#### Issue 1

In [13]:
# Converting all the header name into lower case
df.columns = [x.lower() for x in df.columns]

In [14]:
df

                                                name  address  age  gender
0  Name Hussein Hakeem Address Number 22 Fioye Cr...      NaN  NaN     NaN
1  Name Arojoye Samuel Address 11 Omolade Close O...      NaN  NaN     NaN
2  Name Alex Ezurum Address 1 Adamu Lane, Abuja A...      NaN  NaN     NaN
3  Name Susan Nwaimo Address Number 58 Yaba Stree...      NaN  NaN     NaN
4  Name Ajao Opeyemi Address No12 Olubunmi Street...      NaN  NaN     NaN
5  Name Banjoko Adebusola Address 34 Ngige Street...      NaN  NaN     NaN
6  Name Muhammed Olabisi Address 13, ICAN road, E...      NaN  NaN     NaN
7  Name Oluwagbemi Mojisola Address ACCA Lane, On...      NaN  NaN     NaN

In [15]:
def arrange_data(item):
    item = item.split(' ')
    return (item)

In [16]:
a = arrange_data('Name Hussein Hakeem Address Number 22 Fioye Crescent Surulere Lagos Age 17 Gender Male')
print(a)

['Name', 'Hussein', 'Hakeem', 'Address', 'Number', '22', 'Fioye', 'Crescent', 'Surulere', 'Lagos', 'Age', '17', 'Gender', 'Male']